<a href="https://colab.research.google.com/github/gaveter/Project_cs/blob/master/Project.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [58]:
from google.colab import drive
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

# Project 2019-20
1. Normalize the loan_lenders table. In the normalized table, each row must have one loan_id and one lender.
2. For each loan, add a column duration corresponding to the number of days between the disburse time and the planned expiration time.
3. Find the lenders that have funded at least twice.
4. For each country, compute how many loans have involved that country as borrowers.
5. For each country, compute the overall amount of money borrowed.
6. Like the previous point, but expressed as a percentage of the overall amount lent.
7. Like the three previous points, but split for each year (with respect to disburse time).
8. For each lender, compute the overall amount of money lent.
9. For each country, compute the difference between the overall amount of money lent and the overall amount of money borrowed.
10. Which country has the highest ratio between the difference computed at the previous point and the population?
11. Which country has the highest ratio between the difference computed at point 9 and the population that is not below the poverty line?
12. For each year, compute the total amount of loans. Each loan that has planned expiration time and disburse time in different years must 
have its amount distributed proportionally to the number of days in each year. For example, a loan with disburse time December 1st, 2016,
 planned expiration time January 30th 2018, and amount 5000USD has an amount of 5000USD * 31 / (31+365+30) = 363.85 for 2016, 5000USD * 365 / (31+365+30) = 4284.04
for 2017, and 5000USD * 30 / (31+365+30) = 352.11 for 2018.
Â© 2019 GitHub, Inc.

## Load libraries

In [0]:
import pandas as pd
from datetime import datetime
import re
import numpy as np

## Task1

### Load csv (loans_lenders)

In [60]:
loans_lender = pd.read_csv('/content/drive/My Drive/Foundation of computer science/additional-kiva-snapshot/loans_lenders.csv')
len(loans_lender)

1387432

In [61]:
loans_lender.head()

   loan_id                                            lenders
0   483693  muc888, sam4326, camaran3922, lachheb1865, reb...
1   483738  muc888, nora3555, williammanashi, barbara5610,...
2   485000  muc888, terrystl, richardandsusan8352, sherri4...
3   486087  muc888, james5068, rudi5955, daniel9859, don92...
4   534428  muc888, niki3008, teresa9174, mike4896, david7...

In [0]:
loans_lender["lenders"]=loans_lender["lenders"].str.split(', ') #divisione lenders
loans_lender_norm=loans_lender.explode('lenders')

In [63]:
loans_lender_norm.head(10)

   loan_id        lenders
0   483693         muc888
0   483693        sam4326
0   483693    camaran3922
0   483693    lachheb1865
0   483693    rebecca3499
0   483693  karlheinz4543
0   483693        jerrydb
0   483693      paula8951
0   483693           gmct
0   483693       amra9383

### Result

In [64]:
loans_lender_norm=loans_lender_norm.reset_index(drop=True)
loans_lender_norm.head()

   loan_id      lenders
0   483693       muc888
1   483693      sam4326
2   483693  camaran3922
3   483693  lachheb1865
4   483693  rebecca3499

In [65]:
len(loans_lender_norm)

28293931

## Task2
- For each loan, add a column duration corresponding to the number of days between the disburse time and the planned expiration time

### Load csv (loans)

In [66]:
loan = pd.read_csv('/content/drive/My Drive/Foundation of computer science/additional-kiva-snapshot/loans.csv')
loan.dtypes

loan_id                              int64
loan_name                           object
original_language                   object
description                         object
description_translated              object
funded_amount                      float64
loan_amount                        float64
status                              object
activity_name                       object
sector_name                         object
loan_use                            object
country_code                        object
country_name                        object
town_name                           object
currency_policy                     object
currency_exchange_coverage_rate    float64
currency                            object
partner_id                         float64
posted_time                         object
planned_expiration_time             object
disburse_time                       object
raised_time                         object
lender_term                        float64
num_lenders_total                    int64
num_journal_entries                  int64
num_bulk_entries                     int64
tags                                object
borrower_genders                    object
borrower_pictured                   object
repayment_interval                  object
distribution_model                  object
dtype: object

In [67]:
loan.head()

   loan_id       loan_name  ... repayment_interval distribution_model
0   657307            Aivy  ...          irregular      field_partner
1   657259  Idalia Marizza  ...            monthly      field_partner
2   658010           Aasia  ...            monthly      field_partner
3   659347         Gulmira  ...            monthly      field_partner
4   656933         Ricky\t  ...             bullet      field_partner

[5 rows x 31 columns]

### Check missing values

In [0]:
missing_loan = pd.isnull(loan[["planned_expiration_time"]])

In [69]:
loan.loc[64:69][["planned_expiration_time","disburse_time"]]

          planned_expiration_time                  disburse_time
64                            NaN  2010-11-18 08:00:00.000 +0000
65                            NaN  2010-11-25 08:00:00.000 +0000
66                            NaN  2010-11-25 08:00:00.000 +0000
67                            NaN  2010-11-16 08:00:00.000 +0000
68  2016-11-03 06:10:05.000 +0000  2016-09-07 07:00:00.000 +0000
69                            NaN  2010-11-10 08:00:00.000 +0000

In [70]:
type(loan.loc[68][["planned_expiration_time"]][0])

str

### Conversion attribute 'planned_expiration_time', 'disburse_time' to string

In [0]:
loan["planned_expiration_time"] = loan.apply(lambda x: str(x["planned_expiration_time"]),axis=1) #each row (value is float)
loan["disburse_time"] = loan.apply(lambda x: str(x["disburse_time"]),axis=1)

In [0]:
def difference_dates(date1,date2):
  if (date1=="nan" or date2=="nan"):
    return(np.nan) #float
  date1 = date1[:-10]
  date1 = datetime.strptime(date1,"%Y-%m-%d %H:%M:%S")
  date2 = date2[:-10]
  date2 = datetime.strptime(date2,"%Y-%m-%d %H:%M:%S")
  diff = (date1 - date2).days
  return(diff)

In [0]:
loan["duration"] = loan.apply(lambda x: difference_dates(x["disburse_time"],x["planned_expiration_time"]),axis=1)

In [74]:
zeroDuration = loan[loan["duration"]==0][["planned_expiration_time","disburse_time","duration"]]
len(zeroDuration)

702

### Result

In [75]:
loan.head()[["planned_expiration_time","disburse_time","duration"]]

         planned_expiration_time                  disburse_time  duration
0  2014-02-14 03:30:06.000 +0000  2013-12-22 08:00:00.000 +0000     -54.0
1  2014-03-26 22:25:07.000 +0000  2013-12-20 08:00:00.000 +0000     -97.0
2  2014-02-15 21:10:05.000 +0000  2014-01-09 08:00:00.000 +0000     -38.0
3  2014-02-21 03:10:02.000 +0000  2014-01-17 08:00:00.000 +0000     -35.0
4  2014-02-13 06:10:02.000 +0000  2013-12-17 08:00:00.000 +0000     -58.0

## Task 3
- Find the lenders that have funded at least twice

In [76]:
fundedLoan = loan[loan["status"]=='funded'][["loan_id","status"]]
fundedLoan.head()

   loan_id  status
0   657307  funded
1   657259  funded
2   658010  funded
3   659347  funded
4   656933  funded

### Inner-join between loan_lender and type loan 'funded'

In [77]:
lenders_funded = pd.merge(loans_lender_norm,fundedLoan,how="inner",on="loan_id")
lenders_funded.head()

   loan_id      lenders  status
0   483693       muc888  funded
1   483693      sam4326  funded
2   483693  camaran3922  funded
3   483693  lachheb1865  funded
4   483693  rebecca3499  funded

In [0]:
numberfunded_lenders = lenders_funded.groupby('lenders')['loan_id'].count().reset_index(level=0)
numberfunded_lenders.columns=['lenders','count']

In [0]:
numberfunded_lenders = numberfunded_lenders[numberfunded_lenders['count']>=2]
numberfunded_lenders = numberfunded_lenders.sort_values('count',ascending=False)

### Result

In [80]:
numberfunded_lenders.head()

                  lenders   count
457516          gooddogg1  167512
1309649     trolltech4460  141268
456928               gmct  123164
997312                nms   96713
1276071  themissionbeltco   74067

## Task 4
- For each country, compute how many loans have involved that country as borrowers.

In [81]:
loan.dtypes

loan_id                              int64
loan_name                           object
original_language                   object
description                         object
description_translated              object
funded_amount                      float64
loan_amount                        float64
status                              object
activity_name                       object
sector_name                         object
loan_use                            object
country_code                        object
country_name                        object
town_name                           object
currency_policy                     object
currency_exchange_coverage_rate    float64
currency                            object
partner_id                         float64
posted_time                         object
planned_expiration_time             object
disburse_time                       object
raised_time                         object
lender_term                        float64
num_lenders_total                    int64
num_journal_entries                  int64
num_bulk_entries                     int64
tags                                object
borrower_genders                    object
borrower_pictured                   object
repayment_interval                  object
distribution_model                  object
duration                           float64
dtype: object

In [82]:
loan["status"].unique()

array(['funded', 'expired', 'refunded', 'fundRaising'], dtype=object)

In [0]:
borrower = loan[(loan["status"]=='expired') | (loan["status"]=='fundRaising')]

### Check missing values

In [90]:
missing = pd.isnull(borrower[['country_name']])
missing[missing['country_name']==True]

Empty DataFrame
Columns: [country_name]
Index: []

In [0]:
country_numberLoan = borrower.groupby('country_name')['status'].count()
country_numberLoan = country_numberLoan.sort_values(ascending=False)

### Result

In [92]:
country_numberLoan.head()

country_name
El Salvador    8230
Kenya          6838
Colombia       4923
Tajikistan     3566
Philippines    2783
Name: status, dtype: int64

## Task 5
- For each country, compute the overall amount of money borrowed.

In [0]:
country_amountLoan = borrower.groupby('country_name')['loan_amount'].sum()

In [0]:
country_amountLoan = country_amountLoan.sort_values(ascending=False)

### Result

In [102]:
country_amountLoan.head()

country_name
United States    12801975.0
El Salvador       7655225.0
Kenya             5528650.0
Armenia           5139850.0
Tajikistan        5106425.0
Name: loan_amount, dtype: float64

## Task 6
- Like the previous point, but expressed as a percentage of the overall amount lent.